# DeregisterDialogFromTimerEvents

## Description
Removes the dialog from the timer event registry system.

```pascal
PROCEDURE DeregisterDialogFromTimerEvents(dialogID : LONGINT);
```

```python
def vs.DeregisterDialogFromTimerEvents(dialogID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|the dialog identifier given by CreateLayout or CreateResizableLayout|

## Version
Availability: from Vectorworks 2010

## Category
* Dialogs - Modern